.arm // ενημερώνουμε τον as ότι πρέπει να παράγει κώδικα 32 bits
.text // τοποθετεί τον κώδικα που ακολουθεί σε συγκεκριμένη ϑ έση
.global main // ειδοποιούμε τον as πως πρέπει να εισάγει την ετικέτα main στη λίστα 
των συμβόλων που μπορούν να προσπελαστούν από άλλα προγράμματα
 
main: 
STMDB R13!, {R0-R12, R14} @Ε0 //αποθηκεύει τους καταχωρητές σε διαδοχικές θέσεις 
μνήμης χρησιμοποιώντας μια διεύθυνση μνήμης
 
MOV R0, #0x20 @Ε1 //εισάγουμε στον καταχωρητή R0 τη τιμή 20 
MOV R1, R0, LSL #2 @Ε2 // εισάγουμε στον καταχωρητή R1 το περιεχόμενο του R0 
ολισθημένο κατά 2 θέσεις αριστερά
MVN R2, R1, LSL #1 @Ε3 // εισάγουμε στον καταχωρητή R2 το περιεχόμενο του R1 
ολισθημένο κατά 1 θέση αριστερά
 
LDR R3, =Values @Ε4 // μεταφέρει το περιεχόμενο από τις διευϑ ύνσεις που 
περιγράφονται στο label Values στη μνήμη στον καταχωρητή R3
LDR R4, [R3], #4 @Ε5 // μεταφέρει το περιεχόμενο της ϑ έσης μνήμης στην οποία 
βρίσκεται ο καταχωρητής R3 στον καταχωρητή R4 και αποθηκεύει την τιμή του R3 
αυξημένη κατά 4 στον R4
LDRB R5, [R3], #2 @Ε6 // μεταφέρει το περιεχόμενο της ϑ έσης μνήμης στην οποία 
βρίσκεται ο καταχωρητής R3 στον καταχωρητή R5 και αποθηκεύει την τιμή του R3 
αυξημένη κατά 2 στον R5
LDRSH R6, [R3], #2 @Ε7 // μεταφέρει το περιεχόμενο της ϑ έσης μνήμης στην οποία 
βρίσκεται ο καταχωρητής R3 στον καταχωρητή R6 σε halfword (16 bits) και 
αποθηκεύει την τιμή του R3 επεκτείνοντασ το πρόσημο (32 bits) στον R4
LDR R3, =Stack @Ε8 // μεταφέρει το περιεχόμενο 00000000 που περιγράφεται στο 
label Stack στον καταχωρητή R3
STMIA R3!, {R0-R2, R4-R6} @Ε9 //οι αντίστοιχοι καταχωρητές φορτώνονται με 
αριθμητική σειρά
LDMDB R3!, {R0-R2} @Ε10 //μεταφέρει τα περιεχόμενα από τις θέσεις μνήμης των 
καταχωρητών R0-R2 και κάθε φορά η διεύθυνση προσπέλασης μειώνεται κατά 4
LDMDB R3!, {R4-R6} @Ε11 // μεταφέρει τα περιεχόμενα από τις θέσεις μνήμης των 
καταχωρητών R4-R6 και κάθε φορά η διεύθυνση προσπέλασης μειώνεται κατά 4
 
LDMIA R13!, {R0-R12, PC} @Ε12 //ακολουθείται η ίδια διαδικασία με πιο πάνω μόνο 
που η διεύθυνση προσπέλασης αυξάνεται κατά 4 αφού γίνει η προσπέλαση στη 
μνήμη
 
.data //είναι ντιρεκτίβα και τοποθετεί τα ακόλουθα αριθμητικά δεδομένα 
Values: 
.word 0xCAFEBABA //τα δεδομένα αυτά τοποθετούνται σε θέσεις μνήμης οι οποίες 
σημειώνονται από το label Values
.word 0x82345678 
Stack: 
.word 0,0,0,0 //τα δεδομένα αυτά τοποθετούνται σε θέσεις μνήμης οι οποίες 
σημειώνονται από το label Stack
.word 0,0,0,0 
